print('A', end='')
print('B', end='')
print('C', end='')
print()
print('X')
print('Y')
print('Z')

#По подразбиране `print` поставя единичен интервал между елементите, които отпечатва. 
# Функцията използва аргумента `sep`, за да укаже какъв низ да се вмъкне между елементите; името `sep` е съкращение от *separator* (разделител). 
# Стойността по подразбиране за `sep` е низът `' '` (единичен интервал)

w, x, y, z = 10, 15, 20, 25
print(w, x, y, z)
print(w, x, y, z, sep=',')
print(w, x, y, z, sep='')
print(w, x, y, z, sep=':')
print(w, x, y, z, sep='-----')
# Първият ред от изхода демонстрира стандартния начин на работа на `print` с използване на единичен интервал между елементите. 
# Във втория ред като разделители са използвани запетаи. 
# Третият ред обединява елементите, като използва празен низ за разделител. 
# Петият ред показва, че разделителният низ може да се състои от повече от един знак.